---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartPhaseParametersConflictWithOriginal
source: html/e8d238d5-fab1-cb26-2d41-1c3e647f7d14.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartPhaseParametersConflictWithOriginal Property

The creation and demolition phases of a part must lie between the corresponding phases of the original.

## Syntax (C#)
```csharp
public static FailureDefinitionId PartPhaseParametersConflictWithOriginal { get; }
```